import sqlite3

conn = sqlite3.connect('staff.db')

cursor = conn.cursor()

cursor.execute('''CREATE TABLE IF NOT EXISTS staff (
                  name TEXT,
                  department TEXT,
                  position TEXT,
                  salary INTEGER)''')

cursor.executemany('''INSERT INTO staff (name, department, position, salary) VALUES (?, ?, ?, ?)''', [
    ('刘萍', '技术部门', '技术负责人', 15000),
    ('卢宇', '技术部门', '运维开发工程师', 10000),
    ('邹旭', '技术部门', '项目经理', 10000),
    ('陶晨', '技术部门', '后端开发工程师', 10000),
    ('曹坤', '技术部门', '后端开发工程师', 10000),
    ('周想', '技术部门', '前端开发工程师', 8000),
    ('刘桂英', '总裁办', '总裁秘书', 4500),
    ('张海燕', '总裁办', '普通员工', 3000),
    ('何倩', '总裁办', '普通员工', 3000),
    ('李华', '总裁办', '普通员工', 3000),
    ('汪雪', '销售部门', '销售主管', 4500),
    ('王丹', '销售部门', '普通员工', 2500),
    ('黄辉', '销售部门', '普通员工', 2500),
    ('黄平', '销售部门', '普通员工', 2500),
    ('刘瑜', '销售部门', '普通员工', 2500),
    ('殷文', '销售部门', '普通员工', 2500),
    ('罗桂兰', '销售部门', '普通员工', 2500),
    ('高桂香', '销售部门', '普通员工', 2500),
    ('黄玉', '销售部门', '普通员工', 2500),
    ('张琴', '销售部门', '普通员工', 2500),
    ('李阳', '销售部门', '普通员工', 2500),
    ('丁娜', '生产部门', '生成主管', 5000),
    ('曲旭', '生产部门', '普通员工', 3500),
    ('冉兵', '生产部门', '普通员工', 3500),
    ('刘淑珍', '生产部门', '普通员工', 3500),
    ('陈丽', '生产部门', '普通员工', 3500),
    ('裴欢', '生产部门', '实习员', 2500),
    ('徐凯', '生产部门', '实习员', 2500),
    ('陈伟', '生产部门', '普通员工', 3500),
    ('梁玉华', '生产部门', '实习员', 2500)
])

cursor.execute("SELECT * FROM staff")

rows = cursor.fetchall()

columns = [i[0] for i in cursor.description]

salary_list = [dict(zip(columns, row)) for row in rows]

print(salary_list)
cursor.close()
conn.close()